## Module 2 Live Coding Assignment: Data Structures

**_Author: Jessica Cervi_**


**_This notebook contains the questions and the solution to the live assignment for module 2._**

**_Throughout this assignment, please remember to import all the necessary libraries at the beginning of every exercise._**

### Question 1

Create a Pandas dataframe called `df` containing 4 columns named Id, Continent, Country, Capital and the values 


| id | Continent  | Country | Capital|
|----|-------|-----------|-------|
| 1  | Europe| Italy | Rome|
| 2  | Europe|France |Paris|
| 3  | Asia  | China    |Beijing|
| 4  | North America  | Canada    |Ottawa|
| 5  | Europe|Germany |Berlin|


Sort df in descending order with respect to the column ``Continent''.

In [2]:
import pandas as pd

In [26]:
df_dict = {'id': [1, 2, 3, 4, 5],
          'Continent':['Europe', 'Europe', 'Asia', 'North America', 'Europe'],
          'Country': ['Italy', 'France', 'China', 'Canada', 'Germany'],
          'Capital': ['Rome', 'Paris', 'Beijing', 'Ottawa', 'Berlin']}

In [27]:
df = pd.DataFrame(df_dict)

In [28]:
df.sort_values(by = "Continent", ascending = False)

   id      Continent  Country  Capital
3   4  North America   Canada   Ottawa
0   1         Europe    Italy     Rome
1   2         Europe   France    Paris
4   5         Europe  Germany   Berlin
2   3           Asia    China  Beijing

### Question 2

Consider the dataframe df defined in Question 1. Delete the column with label `Continent` and rename the column `Capital` to `Country Capital'.

In [29]:
import pandas as pd

In [30]:
df.drop("Continent", axis = 1)

   id  Country  Capital
0   1    Italy     Rome
1   2   France    Paris
2   3    China  Beijing
3   4   Canada   Ottawa
4   5  Germany   Berlin

In [14]:
df = df.drop('Continent', axis = 1) #deleted the column

In [15]:
df

   id  Country  Capital
0   1    Italy     Rome
1   2   France    Paris
2   3    China  Beijing
3   4   Canada   Ottawa
4   5  Germany   Berlin

In [23]:
del(df['Continent'])

In [24]:
df.head()

   id  Country  Capital
0   1    Italy     Rome
1   2   France    Paris
2   3    China  Beijing
3   4   Canada   Ottawa
4   5  Germany   Berlin

In [19]:
df = df.rename({'Capital': 'Country Capital'}, axis = 1) #renamed it

In [20]:
df

   id  Country Country Capital
0   1    Italy            Rome
1   2   France           Paris
2   3    China         Beijing
3   4   Canada          Ottawa
4   5  Germany          Berlin

### Question 3

Read the CSV file named "foo.csv" in the data folder and assign it to a dataframe called `df2`. Compute the average of the values of the column `price` and assign it to a variable called `averagePrice`.  Next,  create a filter to get all rows where the column `price` is less or equal than 5. Call this new dataframe `dfPrice`. Print the returned value and dataframe to screen.

In [31]:
import pandas as pd

In [32]:
df2 = pd.read_csv('data/foo.csv')

In [35]:
averagePrice = df2['price'].mean()

In [40]:
dfPrice = df2.loc[df2['price'] < 5]

In [41]:
dfPrice

,id,firstName,lastName,billingId,product,price,birth,dummyCol
6,7,CaRL,Ga%%%uss,323,taco,3,13-07-1970,gonna
7,8,David,H$$$ilbert,624,taaaccoo,3,14-07-1950,let
8,9,Johannes,KEPLER,735,taco,3,22-04-1920,you
9,10,JaMES,M$$ax%%well,875,taco,3,12-03-1923,down
12,13,Max!!!,Planck!!!,111,hamburguer,4,04-01-1994,run
15,16,William,Gilbert###,886,BEER,2,26-03-1958,desert
16,17,Marie,CURIE,912,Rice,1,22-03-2000,you

In [48]:
name = 'Lenny'

In [49]:
'The dog is named Lenny'

'The dog is named Lenny'

In [50]:
f'The dog is named {name}'

'The dog is named Lenny'

In [52]:
print(f'The average price is: ${averagePrice: .2f}')

The average price is: $ 6.05

In [53]:
'The dog is named {}'.format(name)

'The dog is named Lenny'

### Question 4

Create a python lambda function called `addTen` that adds 10 to a certain variable `x`. Next apply this function to all the entries of the column `billingId` in the database df2 form the previous question. Assign the new values to a list called `addedValues`. Return the list to screen.

**Hint:** use the pandas command `map`.

In [47]:
import pandas as pd

In [55]:
addTen = lambda x: x + 10

In [73]:
try2 = (df2['billingId'].apply(addTen).to_list()).append('Steve')

In [74]:
try2

In [71]:
try2.append('Steve')

In [72]:
try2

[133,
 433,
 561,
 531,
 644,
 682,
 333,
 634,
 745,
 885,
 1002,
 244,
 121,
 563,
 126,
 896,
 922,
 822,
 477,
 'Steve']

In [61]:
try2.to_list()

[133,
 433,
 561,
 531,
 644,
 682,
 333,
 634,
 745,
 885,
 1002,
 244,
 121,
 563,
 126,
 896,
 922,
 822,
 477]

In [57]:
addedValues = list(df2['billingId'].apply(addTen))

In [58]:
addedValues

[133,
 433,
 561,
 531,
 644,
 682,
 333,
 634,
 745,
 885,
 1002,
 244,
 121,
 563,
 126,
 896,
 922,
 822,
 477]

### Question 5

Split the dataframe df2  from the previous questions into two dataframes with odd rows in one dataframe and even rows in a different one. Assign the new dataframes to `df2Odd` and `df2Even` and print them to screen.

In [75]:
import pandas as pd

In [82]:
df2.iloc[::2]

,id,firstName,lastName,billingId,product,price,birth,dummyCol
0,1,Luis,Alvarez$$%!,123,Cake,10,07-07-1980,never
2,3,NiELS,Böhr//((%%,551,pizza,8,09-07-1990,give
4,5,Albert,Einstein,634,pizza,8,11-07-1990,up
6,7,CaRL,Ga%%%uss,323,taco,3,13-07-1970,gonna
8,9,Johannes,KEPLER,735,taco,3,22-04-1920,you
10,11,Isaac,Newton,992,pasta,9,15-02-1999,never
12,13,Max!!!,Planck!!!,111,hamburguer,4,04-01-1994,run
14,15,((( Heinrich ))))),Hertz,116,pizza,8,30-11-1956,and
16,17,Marie,CURIE,912,Rice,1,22-03-2000,you
18,19,JAMES,Chadwick,467,NaN,10,03-05-1921,#

In [83]:
df2.iloc[1::2]

,id,firstName,lastName,billingId,product,price,birth,dummyCol
1,2,André,Ampère,423,piza,8,08-07-1950,gonna
3,4,PAUL,dirac$,521,pizza,8,10-07-1954,you
5,6,Galileo,GALiLEI,672,arepa,5,12-08-1930,never
7,8,David,H$$$ilbert,624,taaaccoo,3,14-07-1950,let
9,10,JaMES,M$$ax%%well,875,taco,3,12-03-1923,down
11,12,Emmy%%,Nöether$,234,pasta,9,08-12-1993,gonna
13,14,Fred,Hoy&&&le,553,pizzza,8,27-06-1997,around
15,16,William,Gilbert###,886,BEER,2,26-03-1958,desert
17,18,Arthur,COM%%%pton,812,110790,5,1899/01/01,#

In [78]:
twenty_ints = list(range(20))

In [80]:
twenty_ints[::2]

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

In [81]:
twenty_ints[1::2]

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

In [84]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         19 non-null     int64
 1   firstName  19 non-null     object
 2   lastName   19 non-null     object
 3   billingId  19 non-null     int64
 4   product    18 non-null     object
 5   price      19 non-null     int64
 6   birth      19 non-null     object
 7   dummyCol   19 non-null     object
dtypes: int64(3), object(5)
memory usage: 1.3+ KB

In [86]:
df2['birth'] = pd.to_datetime(df2['birth'])

In [87]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         19 non-null     int64
 1   firstName  19 non-null     object
 2   lastName   19 non-null     object
 3   billingId  19 non-null     int64
 4   product    18 non-null     object
 5   price      19 non-null     int64
 6   birth      19 non-null     datetime64[ns]
 7   dummyCol   19 non-null     object
dtypes: datetime64[ns](1), int64(3), object(4)
memory usage: 1.3+ KB